web/app/export/export_file.rb

SELECT "appointments".* FROM "appointments" WHERE "appointments"."professional_id" = ?  [["professional_id", 1]]
---
        def self.list_appointments_professional_with_date_and_hour(professional, day, hour)
            list = Array.new
            professional.appointments.each do |appointment|