web/app/controllers/appointments_controller.rb

  def create
    @appointment = Appointment.new(appointment_params)

    respond_to do |format|
      if @appointment.save
---
INSERT INTO "appointments" ("date", "name", "surname", "phone", "notes", "professional_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @appointment.update(appointment_params)
---
UPDATE "appointments" SET "date" = ?, "notes" = ?, "updated_at" = ? WHERE "appointments"."id" = ?  [["date", "2021-12-10 15:25:00"], ["notes", ""], ["updated_at", "2021-12-08 23:15:45.673676"], ["id", 1]]

    def set_professional
      @professional = Professional.find(params[:professional_id])
---
SELECT "professionals".* FROM "professionals" WHERE "professionals"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]