web/app/controllers/professionals_controller.rb

SELECT "professionals".* FROM "professionals"
SELECT "professionals".* FROM "professionals" WHERE "professionals"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def download_appointments
    p = []
    if params[:professionals].empty?
      @professionals.each do |pro|
        p << pro
      end
    else
      p << Professional.find(params[:professionals])