web/app/controllers/professionals_controller.rb

SELECT "professionals".* FROM "professionals"
---
  def index
    @professionals = Professional.all

INSERT INTO "professionals" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "Alma Estevez"], ["created_at", "2021-12-12 23:11:40.836675"], ["updated_at", "2021-12-12 23:11:40.836675"]]
---
  def create
    @professional = Professional.new(professional_params)

    respond_to do |format|
      if @professional.save

UPDATE "professionals" SET "name" = ?, "updated_at" = ? WHERE "professionals"."id" = ?  [["name", "Juan Perez"], ["updated_at", "2021-12-08 19:08:56.083504"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @professional.update(professional_params)

DELETE FROM "professionals" WHERE "professionals"."id" = ?  [["id", 1]]
---
  def destroy
    @professional.destroy

SELECT "professionals".* FROM "professionals" WHERE "professionals"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_professional
      @professional = Professional.find(params[:id])