web/app/validators/appointment_validator.rb

SELECT "appointments".* FROM "appointments" WHERE "appointments"."id" = ? LIMIT ?  [["id", 17], ["LIMIT", 1]]
---
  def validate(record)
    begin
      a = Appointment.find(record.id)

SELECT "professionals".* FROM "professionals" WHERE "professionals"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def validate_date_not_repeat_for_professional(record)
    p = Professional.find(record.professional_id)